{
  "title": "Entitled Mom keeps telling her kid to take my things.",
  "body": "Today was my first time visiting Crumbl Cookies. I bought 4 huge cookies to try and share with my friends. On my way home I decided to enjoy the cookieI had gotten for myself. \n\n\nI was sitting at one of the little picnic tables where my condo is. And who should show up? But of course my neighbor's friend who is an entitled parent. (This is not the first time I've encountered her.)\n\n\nSo I'm looking at my phone and eating my cookie. Basically doing as many errands on my phone as I can. When suddenly I hear this entitled parent open her mouth.\n\n\n\"Look at that, Olivia! There's three giant cookies in there.\"  Entitled mom is pointing to my box of cookies.\n\n\n \"Why don't you go ahead and pick out a cookie that you like? As we all know it's very important to learn how to share with others. And this lady didn't share with you the last time we saw her. Maybe she's learned her lesson.\" Entitled mom says. \n\n\n( Brief Backstory: The last time I encountered this woman, I had two candy canes because my blood sugar was low and I was on my way to my doctor's appointment. I'm a type 1 diabetic. I obviously I did not give the child one of my candy canes. At the time I needed it as life-saving medicine.)\n\n\nAnyways I look up and this entitled mother is folding her arms and giving me the most smug look ever. Her kid comes running up to grab a cookie out of my box. But I'm faster, I immediately close the cookie box. The little girl seemed shocked.\n\n\nThe mom lets out the most obnoxious grunt. \"Oh come on you don't need all those cookies! You didn't even share with her the last time you saw her. I'm trying to teach her manners and sharing. We share when we have more than what we need!\"\n\n\nI look at the little girl, ignoring the mother. And I said to her: \"Today I'm going to teach you another very important lesson. Can you listen carefully?\"\n\n\nThe cute little girl nods. I told her: You should never take a food from a stranger. You should only take food from people you know. Because for all I know there could be something that you're allergic to in these cookies, and that might make you very sick. I don't want to accidentally give you something that might make you sick. You don't want that either, right?\n\n\nThe little girl nods. I smile at her. I say: Also another thing to learn in life is sometimes we can't always get what we want. So you might want one of my cookies, but for all you know I have other people that I'm going to share them with. And then they'll be sad that they didn't get a cookie. We should always ask before taking things from someone.\n\n\nI tell her I'd be happy to share a piece of my candy with her if she asks me nicely the next time I see her. And if her mommy can confirm that there's nothing in it that might make her have an allergic reaction. The little girl smiles at me, says ok, and thanks me.\n\n\nThe look on the entitled mom's face was priceless. I think she probably would have slapped me upside the head. But I was using my wheelchair at the time, because my dysautonomia is really acting up today. \n\n\nI don't know why but it looks especially bad if you hit somebody using a wheelchair. Even more so if you do it in front of a large group of people. Which there are plenty of people out enjoying the nice weather today.\n\n\nI got enough satisfaction in not only teaching that kid lessons that she needs to learn, but then just by watching the entitled mother storm off and drag her daughter back into one of the other surrounding buildings.\n\n\nI wasn't lying. I did get the cookies to share with my brother and friends. Perhaps if they had asked me nicely I wouldn't have mind sharing the one giant cookie I had bought for myself. \n\n\nBut both times I have encountered this entitled mom she has just told her kid to take something from me without asking. That poor kid is going to grow up on the wrong path if she thinks she can get away with that. \n\n\nHowever, if the kid does happen to ask me nicely the next time I see her I will follow through on my promise. I usually do have low blood sugar candy to spare on me. I'll give her one of my little bags of Skittles.\n\n\nCrazy entitled parents. I'm glad this woman doesn't live here. I don't want to have to encounter her more than every once in awhile. She's the opposite of Mary Poppins. Practically unpleasant in every possible way. ",
  "subreddit": "entitledparents",
  "unused_content": true
}