{
  "title": "My dad said he wants to bang a girl with me",
  "body": "So it all started when I was in the washroom taking a shit, my father won’t leave me alone and kept saying I will be rich by making food (obviously that’s great and I support him on that as all people should support there close ones on there goals if they are morally good).\n\nHowever he kept on saying when I already answered and I said  “hey dad I’m trying to take a dump can you leave me alone please?”. Wouldn’t shut up and “told him let me take a shit in peace” (in my family cursing is very common I’m trying to get rid of it and I’ve been getting better at that until today) anyways, I finished using the washroom and took a shower and he said that he will get rich from making food (again that’s great) out of annoyance I made a joke kinda of like a “when pigs fly joke” the joke I said was “yeah sure and I’ll bang Megan Fox” (I had a crush on her when I was like 5) (In my family the men always have a running joke like that, my uncle once said “I have a higher chance at banging Angelina Jolie than winning the lottery” but we never once joked about banging a girl with our own relatives.)\nMy father told me and said “we can bang her together” and obviously like a normal human being I got mad because that’s not ok that’s like really weird, ima just say he used to have a lot of half naked girl in his camera roll so you put 2 and 2 together he’s kinda down bad.\nSaying that to your friends is still pretty weird but saying that to your son?\nObviously I am not ok with this I told him “what the hell is wrong with you, you can say that to your friends but to your own son” he said “why are you laughing”. \n\nHe tends to do this when no one is laughing and cause he thinks he’s funny and keeps saying why are you laughing until someone smiles but this time I wasn’t because I was just genuinely pissed off so much frustration I punched a hole in the wall cuz how could he joke around like that like I don’t give a shit if he says he’s gonna bang a girl but to joke around about banging a girl with your own son in a threesome is actually really disturbing. I Said “do you think this is a joke? What the actual fuck is wrong with you?” He got mad cuz he knew he was wrong for that and started cussing at me saying that I shouldn’t be mad cuz it’s just a joke? Shit like that is actually fucking weird to say that to your own son the thought of fucking someone with your own relative is actually really disturbing.\n\nIt’s been like this for years, before you say I should just ignore him. I have for more than a decade I finally had enough! he blames me for getting fired he blames me for losing money but he let his ex (who happens to be my mom she left me by the way and I’m starting to wonder why, maybe cuz of my dads behaviour) take about 150k from him (my mom owes my about 11k). even his mom, my grandma agrees that he’s a fuck up\nHe got kicked out of his moms house for being stubborn and to wild \nHe also likes to tell me how he banged his ex girlfriends (he had a lot) when I never even asked and this was like when I was 14-15 \n\nI am Diagnosed with pretty bad OCD it got so bad to the point that I used to say to myself “if I didn’t punch my self in the face a certain amount of times than my whole family would die” (and I would actually do it) and had a lot of intrusive and unwanted thoughts i used to go to a psychiatrist and therapy a lot before but I was getting better and I have anger problems it was getting better but Until when he said that because I used to be such a fucking pussy price of shit mess that these thoughts made stop going to school from the fear of bullying and held me back so much that I became a big ass pussy and couldn’t even talk to fucking strangers)\n\nI do wrong shit too. I accept that it doesn’t matter if my dad or mom leaving or whoever causes my anger it will still be my fault if I get mad. but then he said sorry than said but you shouldn’t get mad grow up it’s just a joke, that’s exactly why I’m mad that he’s taking it as a joke and not seriously from my history of therapy and psychiatrists \nAnd he should’ve said that after I’ve calmed down he’s not truly sorry he just like to call out the other wrong doings of others to hide his ass \n\nNo grown up jokes around like that and he knew the shit I went to too\nThis guy always tries to pick fights on the streets swears informer of kids and in church \nI’m just low-key thinking of running away now\nThis guys act like he can get way with it just because he’s done some right shit before I used to say that exact thing when I was younger and he would literally tell me “just because you’ve done right doesn’t mean you will be excused when you’ve done wrong” and when I told the same thing to him all the sudden these rules don’t apply to him?\n\nI only get mad when he starts acting like this and because he acts like this but then again even if he is the cause I’d still be in the wrong for getting mad. Thing that questions me is that he doesn’t say the same thing he says “I’m sorry but you did this and it’s your fault and maybe if you didn’t do that I wouldn’t get mad” when he does shit in the first place.\nThoughts?\n\nI apologize if I sound very hostile I’m just so fucking pissed off right now but it doesn’t give me a right to ramble like this, can someone just please tell me what he does is fucked up ",
  "subreddit": "entitledparents",
  "unused_content": true
}