{
  "title": "TIFU by making my office enact martial law due to my cooking",
  "body": "\nEight years ago, when I was a 20-year-old intern in the office I now work in full-time, I made a horrible mistake. I’d been there for maybe a month and I was loving it, but outside work I had zero skills. I hadn’t learned how to cook anything and I’d just improv my way through food, so whenever I made “soup,” I’d just dump a shitload of frozen vegetables whole into a giant mug of broth and microwave it. \n\nMy department shares a floor with HR, and it’s basically a long hallway of office doors on each side with a tiny kitchenette in the middle (it’s very Lumen, except for how the office doors are noticeably weirdly small for their frames - Ben Stiller would never). It was a Saturday and I went in to do some work, so I was the only person on the floor. I’d packed a soup for lunch, which I’d made by dumping a whole bag of frozen peas in one of my comically large ceramic soup mugs and adding some broth. At around noon I chucked it in the kitchenette microwave and somehow within a few minutes, the broth got to borderline boiling. And for some reason, when I reached to get it, I grabbed my soup not by the handle but by the mug itself. My hand had that delay between registering intense pain and reacting to it, and in that time I’d taken the soup out of the microwave, swung turned and was holding it over the floor of the hallway. I screamed. I dropped the mug.\n\nWhatever, right? It’s just a mug, I could just clean it up. Ha. Imagine. What a world that would be. Instead, when the mug hit the floor, it shattered and… good god, the peas. I know there couldn’t have been hundreds of them, but it genuinely looked like it, it was like a grenade of peas that exploded into 20 power washers blasting peas in every direction. I guess the heat also hardened them or something because they were like little rubber bullets, bouncing every direction insanely far down both sides of the hallway, with more buoyancy than I thought anything edible could have. The peas went absolutely fucking everywhere, and remember those awkward too-small doors? Yeah, turns out there’s a giant two-inch gap between the bottom of them and the floor, which is more than enough space for 50 peas to jettison themselves under every single doorframe and rocket to the backs of each office, way beyond where I could reach them even with a huge stick, which I also didn’t have. \n\nI’ve asked myself so many times over the years — in what fucking world were you going to eat all those peas? Was it TWO entire bags of frozen peas in there? All I could do was force myself to stop crying, mop up the broth in the hallway and retrieve the maybe five out of 5,000 peas that hadn’t gone under one of 10+ locked office doors for basically everyone in HR. I scrubbed the floors, collected every tiny sliver of the mug corpse in a bag and threw it out in a public dumpster 30 minutes away. Then I went home and thought to myself, “Maybe they won’t notice.”\n\nThus began The Pea Incident, our department’s ground zero, the biggest thing that ever happened in the office to this day. All anyone talked about for weeks were their theories about who broke in on the weekend and put such an insane amount of peas in everyone in HR’s offices, and how they did it (I vehemently agreed with everyone who suspected my least favourite office alcoholic). They called a series of executive meetings about a security issue and oversight in staff safety. There were so many presentations. I remember an exec asking, “What if it isn’t peas next time? What if it’s ANTHRAX?” I sat in meeting after meeting about it, taking the worst notes I’ve ever taken because my hands were shaking so badly I could barely type. Everyone had to start locking their office doors whenever they left, even if they’re just going to the bathroom or popping out for a second. They put additional scan locks on all the doors to the entire floor, and everyone still needs a special key fob to get the elevator to open on the right floor. \n\nI developed stomach ulcers from the stress and barely slept for months, I was so terrified that someone would find out it was me. I’ve been scared for almost a decade, as my internship became a freelance position, then several contract positions, then a part-time permanent role, then, finally full-time permanent. And the stakes just kept getting higher (I have a chronic illness and my meds had hit more than $600 a month over the pandemic).\n\nBut thankfully, due to that very pandemic and super high turnover rates, slowly over the last eight years, everyone who was there for The Pea Thing has left. And the thing that I desperately needed to be forgotten was lost. Pea history became pea legend. Pea legend became pea myth. And for two and a half thousand years, the ring passed out of all knowledge. Until yesterday. Because fucking “Carol” (not her real name) is back covering a mat leave. And Carol asked me yesterday if I remember the peas. I said, “No, I must have blocked the memory out because I am highly allergic to peas.” She said she still wonders who did it. She’s here for another eight months at least and I cannot let her catch me. Fuck you, Carol, and FUCK PEAS. I fucking hate peas. \n\nTL;DR: Dropped a mug of peas in an empty office while I was an intern and they went under every single office door, thereby creating a massive security emergency and office-wide mystery that no one has cracked. I am playing a dangerous game.  \n\nEdit: buoyant (typo) changed to buoyancy (not a typo I think) \nEdit2: Thank you for the golds! It eases the pain somehow ",
  "subreddit": "tifu",
  "unused_content": true
}