{
  "title": "TIFU by forgetting to change my Doctor Who ringtone before a date.",
  "body": "This happened earlier this week, and it still plays on a loop in my head every time I try to sleep.\n\nI met someone online about a month ago. We had a surprisingly easy connection ,a lot of shared interests, similar sense of humor, and a way of texting that didn’t feel like a chore. After a few weeks of back-and-forth, we made plans to meet in person. She picked the movie, I picked the restaurant, and we decided to just see where the night took us.\n\nThe date couldn’t have gone better. The movie was solid, the conversation flowed, and the chemistry was definitely there. At dinner, we sat close without even thinking about it. It felt natural, and in a way I hadn’t felt in a long time. Afterward, she invited me back to her place, and I did my best not to overthink things.\n\nHer place was cozy and tastefully decorated, the kind of apartment that makes you instantly feel underdressed, even if you're technically not. We had a couple of drinks, sat on the couch, and the atmosphere shifted in the way it does when you both know what’s about to happen without needing to say it.\n\nThings escalated. In a good way. It felt right, not rushed. The kind of rare connection that actually lives up to the anticipation you’ve been building up in your head for weeks. Everything was falling into place.\n\nThen, at the exact wrong moment, my phone, which was still in my jacket across the room, erupted with an aggressively loud, chaotic remix of Dugga Doo from Doctor Who.\n\nI’d downloaded it the week before. It was this ridiculous TikTok remix of Dugga Doo that had gone viral in the fandom. I thought it was hilarious, absurd, catchy, and completely unhinged. I made it my ringtone as a joke. It was funny at the time. I forgot all about it.\n\nUntil that moment.\n\nShe pulled back. Everything stopped. The atmosphere vanished in a split second, like someone had flipped a switch. I scrambled over to kill the sound, but the damage was done. We both kind of reset, like trying to remember what you were just doing after someone walks in on you.\n\nWe sat around for a while after that, talking about random things, but the mood never really came back. Eventually, I got my jacket, thanked her for the night, and headed home.\n\nShe’s still texting me, so it’s not like the connection’s gone but I definitely killed the momentum. Pretty sure I’ll be hearing “Dugga Doo” in my nightmares for the next few weeks.\n\nLesson learned: never let your fandom obsession get between you and a real-life moment. And always, always, put your phone on silent.\n\nEdit: I realised i typed the week before I meant the day before.\n\nTL;DR: Had an amazing date with someone, went back to her place, and just as things were heating up, my phone blasted a meme remix of Dugga Doo, Ruined the moment completely. Still recovering.",
  "subreddit": "tifu",
  "unused_content": true
}