{
  "title": "TIFU by thinking I had a ‘sweat rash’ for over a year",
  "body": "I few years ago I decided a career change was in order and followed my love of plants into horticulture and conservation. I absolutely love my work, and a bit over a year ago was offered a permanent position with an amazing nursery. It’s the best job I’ve ever had and I love almost every part of it. \n\nThe one thing I find hard to deal with is working outside in summer. Where I am gets hot, often over 40C (105F) and I have always been a winter person preferring to hide in air conditioned comfort during heat waves. But with plants that’s not an option so I decided I’d toughen up and learn to deal with it.\n\nBeing sweaty is part of the job, but the worst part for me is under boob sweat. I’m a bit heavier, so I sweat a lot there and always had a red, irritating rash. (Editing here to add - I’m heavy in the chest, average in the rest. Not morbidly obese.) I’ve tried different things like antiperspirant and rash cream but it was always a problem. I just figured I’d have to live with it.\n\nA few days ago I noticed a few rashy spots on my side, and then a few more appeared. I asked my doctor about it and she said it looked like folliculitis and said it often happens in summer when people are sweaty. Couple this with being around potting mixes and composts all day and it’s caused me a small bacterial skin infection. She gave me the name of an antibacterial wash and sent me on my way.\n\nI picked up the wash and figured since I was using it on my stomach I might as well see if it had an effect on my sweat rash. Well, today my rash is almost gone. So I’ve had a bacterial skin infection for over a year and just brushing it off as sweat rash. I feel so much better, but I can’t help feeling foolish that I could’ve had this dealt with ages ago and not been in so much discomfort at work. At least I know now I guess.\n\nTL;DR - I put up with a bacterial skin infection for over a year because I thought it was just sweat rash.",
  "subreddit": "tifu",
  "unused_content": true
}