{
  "title": "TIFU by causing a sixth-grade field trip to have a traumatic bathroom experience",
  "body": "TL;DR:\nI’d been constipated for three days, finally found relief at a public park bathroom with no ventilation. Mid-process, an entire sixth-grade field trip stormed in, gagged, screamed, and reacted like they were in a horror movie. I had to sit through the chaos silently, then walk out knowing they all knew it was me. Then I went on my run like a hero.\n\n\n\n\nThe Great Bathroom Showdown\n\nSo a little backstory: I’d been constipated for three days—nothing was coming out. Then, today, my body decided it was finally go-time… right as I was getting ready for a run at the park.\n\nOf course, being at a public park, the only option was one of those grimy public restrooms. Gross, I know. I went in and quickly realized there was just one stall and one urinal. No ventilation. Just a humid, muggy, stale-aired box of shame.\n\nAbout 15 minutes into what I’ll generously call my “bathroom adventure,” I heard a crowd approaching the door. The second it opened, I realized—field trip. Sixth-grade boys.\n\nNow, if you’ve ever been around middle schoolers, you know subtlety is not their strong suit.\n\nThe first wave walked in, and immediately the gagging started. “OH MY GOD,” “This is the worst thing I’ve ever smelled,” “What is that?!” They were dramatic—but honestly, I couldn’t blame them. I’d been brewing that situation for three days.\n\nBut it didn’t stop there. The kids just kept coming. It was like a clown car of chaos. Every new group came in, got hit with the stench wall, gagged, screamed, and then ran out to warn the next wave. All the while, I’m in the stall, silently praying for mercy, trying not to laugh or break composure.\n\nSince there was only one urinal, the poor kids had to wait in line… inside. One by one, they were forced to endure the hell I’d created—gagging, talking, wondering aloud what sort of demon had done this. And it was me. Just me. Stewing in the shame, trying to keep it together.\n\nEventually, the stream of kids slowed. But by now, everyone knew how bad it smelled—and they were all waiting right outside the door. I knew it. They knew it. We were all aware of the showdown that was about to happen.\n\nFinally, I emerged. There was one chaperon left inside, washing his hands. He turned, looked at me, and gave me a face of pure disgust—like I had personally betrayed his faith in humanity.\n\nI washed my hands, fixed my hair, walked out with pride… and then went on my run.\n\nAfterwords: 10/10 best run I’ve had in months ",
  "subreddit": "tifu",
  "unused_content": true
}