{
  "title": "TIFU but we still had lunch!",
  "body": "This is a maybe nsfw so figured I would tag just in case. Let’s go. I once was a VP with a work from home job. Also single and casually dating online. I met a woman, and after a couple weeks of chatting and phone calls, we made a first lunch date. Oddly, she insisted on picking me up from home. That day I was wearing a dress shirt and sweat pants, while standing in my open concept kitchen with my lap top on a high island. I was having a management meeting via Zoom with both video and sound engaged. It was supposed to end at noon. She arrives to my home around 1150 and texts from the driveway. I tell her I am on a work call but she can come in if she wants… she does. She comes in smiling and sits on one of my couches off view from my laptop camera. My meeting continues and goes long. At about 1215 my stomach starts to churn. I was stuck on the video call because our CEO was a tyrant. Slowly my gut starts rolling and rolling. I felt a very faint cold sweat begin to brew. Coming to the conclusion that trusting a fart and relieving a little pressure would be the preferred course of action, I gently shifted my weight while maintaining my on camera persona. I tried to eke out a small TOOT. Instead, my bowels and my asshole opened up. I had a massive shit, in my pants, all down my left leg. It was the worst. In that moment, my date starts laughing loudly and proclaims “DID YOU JUST SHIT YOUR PANTS!?”…. The zoom line was open. They all heard it but nobody moved. The CEO starts the Who Done It interrogation. The date is still laughing. I want to crawl away and hide somewhere dark. For another ten minutes I stand there in my own poop. The call finally ends. I turn to her and say… well. I guess lunch is off, sorry for having you come all this way. She says “dude, I am in healthcare and hungry, go get your poo pants off and take a shower, let’s goooooo”. We dated for a few months. Definitely one of the top ten most embarrassing of my life. \nTLDR… never trust a fart on a first date. Cheers! K. ",
  "subreddit": "tifu",
  "unused_content": true
}